jonathanhawkins/SenseCAP-Watcher-Firmware/examples/aligned-livekit/voice_agent/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASH_MODE_AUTO_DETECT=n

# Match Working Firmware Baselines (Critical Hardware)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_BOOTLOADER_VDDSDIO_BOOST_1_9V=y
CONFIG_FREERTOS_HZ=100

# Console: Match Aligned-Realtime (UART primary, USB secondary)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESPTOOLPY_BAUD_115200=y
CONFIG_ESPTOOLPY_BAUD=115200

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y

# ESP-IDF version (used by esp_codec_dev Kconfig)
CONFIG_ESP_IDF_VERSION="5.4.3"

# Memory Management (Optimized for PSRAM)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=262144
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# System / Stability
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
# CONFIG_ESP_INT_WDT is not set
# CONFIG_ESP_TASK_WDT_EN is not set

# Network Tuning
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5760
CONFIG_LWIP_TCP_WND_DEFAULT=5760
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=1024
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
CONFIG_WS_BUFFER_SIZE=2048

# LVGL
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_USE_QRCODE=y

# MBEDTLS Configuration for DTLS-SRTP
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_DTLS_SRTP=y
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y

# Disable Data Channel to avoid Atomic Link Error
CONFIG_ESP_WEBRTC_DATA_CHANNEL=n

# Force Audio Codec to use Legacy I2C Driver (Critical for V10)
CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=y

# Allow legacy I2C driver even if driver_ng is linked by unused components
CONFIG_I2C_SKIP_LEGACY_CONFLICT_CHECK=y

# ESP Speech Recognition wake word (ensures srmodels.bin is populated)
# CONFIG_SR_WN_WN9_XIAOMEITONGXUE_TTS is not set
